Autodesk.Revit.DB.DataExchangeMessageId
Predefined message ids for DataExchangeLog.
Since:
2016
Since:
2016

Autodesk.Revit.DB.DataExchangeMessageId.EmptyObject
A warning level message. The conversion encountered an object with no data to convert. The object will be ignored. This may indicate a problem with incoming data.

Autodesk.Revit.DB.DataExchangeMessageId.InvalidRenderingStyle
An error message. The conversion code was unable to process a render style. The created model will differ in visual appearance.

Autodesk.Revit.DB.DataExchangeMessageId.ObjectNotConverted
An error message. The conversion code was unable to process a valid supported source object.

Autodesk.Revit.DB.DataExchangeMessageId.ObjectNotSupported
A warning message. A source object was not converted.

Autodesk.Revit.DB.DataExchangeMessageId.GenericError
A catch-all error code. Used for errors that are not enumerated explicitly.

Autodesk.Revit.DB.DataExchangeMessageId.InvalidDataSet
No data could be imported. Would typically be reported as a error. May be reported as a fatal error.

Autodesk.Revit.DB.DataExchangeMessageId.InvalidSourceObject
An error message. A source object was found to be invalid.

Autodesk.Revit.DB.DataExchangeMessageId.UnexpectedResult
Unexpected result produced by a data conversion operation. Conversion may continue, but the results should be carefully reviewed.

Autodesk.Revit.DB.DataExchangeMessageId.ObjectCreated
An informational message. An object - a face, edge, solid, etc. - has been created successfully.

Autodesk.Revit.DB.DataExchangeMessageId.UnitOfProgressCompleted
That message will be sent at reasonable intervals to provide the using application an opportunity to update its progress indicator.

Autodesk.Revit.DB.DataExchangeMessageId.None
No message.